hybridCentralSolvers/Tutorials/compressible/RiemanToro/Test2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|U|h|p).*"
    {
        solver          PBiCGStab;
        preconditioner	DILU;
        tolerance       1e-015;
        relTol          0.0;
    }
}

PIMPLE
{
                                
    momentumPredictor           false; //true;
    nCorrectors                 1;
    nOuterCorrectors            3;
    nonOrthogonalityThreshold   60;
    skewnessThreshold           0.5;
    updateEnergyInPISO          true;
    fluxScheme                  Kurganov; //Tadmor;
    
    kappaFunction
    {
        type standardMachToAcCourantRatio;
        
        standardMachToAcCourantRatioCoeffs
        {
        }
        
        //type acceleratedSonicCourantInverse;
        //
        //acceleratedSonicCourantInverseCoeffs
        //{
        //    writeMaxMin true;
        //    power       1;
        //    resetCoupledBoundaries false;
        //    reinterpolateToFaces   false;
        //}

    }



}

// ************************************************************************* //
